app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def release_date_header
    @movies = Movie.order("release_date").all