app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def sort_title
    @movies = Movie.all