app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY title
---
  def title_header
    @movies = Movie.all